//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameLibTime.h
//!
//! @brief  DxLibの時間関連への追加機能のヘッダファイル
//!
//! @date   2017/3/27
//!
//! @author S.Takaki
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once



// 関数の宣言 ==============================================================

// フレームタイマーの更新
void  UpdateFrameTimer(void);

// 直前のフレームからの経過時間の取得
float GetFrameDeltaTime(void);

// フレームレートの取得
float GetFrameRate(void);
