//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameLibMath.h
//!
//! @brief  DxLibの数学関連への追加機能のヘッダファイル
//!
//! @date   2018/7/1
//!
//! @author S.Takaki
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once



// ヘッダファイルの読み込み ================================================
#include <minwindef.h>



// 関数の宣言 ==============================================================
// <角度の単位変換> ----------------------------------------------------

// [度]から[ラジアン]への単位変換
float ToRadians(float degree);

// [ラジアン]から[度]への単位変換
float ToDegrees(float radian);


// <数値> --------------------------------------------------------------

// 指定した値を下限～上限の範囲内に収める(int版)
int   ClampI(int   x, int   min, int   max);

// 指定した値を下限～上限の範囲内に収める(float版)
float ClampF(float x, float min, float max);

// 浮動小数点数型の誤差を考慮に入れた比較
BOOL FloatEquals(float a, float b);
